Table of Contents
 Class CoordSystemByPoint
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Coordinates system defid by the point and the plane
[OpenModelClass("CI.Geometry3D.CoordSystemByPoint,CI.Geometry3D")]
public class CoordSystemByPoint : CoordSystem
Inheritance
object
OpenObject
CoordSystem
CoordSystemByPoint
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 InPlane
Point is in Plane
public Plane InPlane { get; set; }
Property Value
Plane
 Point
Point where Y o Z axis is located
public Point3D Point { get; set; }
Property Value
Point3D
 Edit this page